bibidentuhanoi/P4autoBoat/tools/espnow_bridge/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=512
# TX FIFO must hold a whole COBS-framed telemetry frame in ONE write_queue()
# call, otherwise usb_write_all() stalls waiting for the FIFO to drain and each
# stall costs a full 10 ms FreeRTOS tick (CONFIG_FREERTOS_HZ=100) — ~20-30 ms
# against a 50 ms budget at 20 Hz.  Measured frames (4 targets/zone):
#   trimmed SensorSnapshot ~1126 B COBS, full ~2299 B COBS.
# 4096 clears both with headroom; larger payloads (JPEG) still loop correctly.
CONFIG_TINYUSB_CDC_TX_BUFSIZE=4096
CONFIG_ESP_WIFI_PS_NONE=y
